app/controllers/songs_controller.rb

  def edit
    if invalid_artist_id?
      flash[:alert] = "Artist not found"
      redirect_to artists_path
    else
      @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]